src/Автолавки/src/Documents/ПутевойЛист/ПутевойЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПутевойЛист</name>
  <basedOn>Document.ГрафикПоездки</basedOn>
  <attributes>
    <name>НомерГрафика</name>
    <type>
      <types>DocumentRef.ГрафикПоездки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокГорючегоПриВыезде</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокГорючегоПоВозвращении</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокТочек</name>
    <attributes>
      <name>ТочкаМаршрута</name>
      <type>
        <types>CatalogRef.НаселенныеПункты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПрибытияПоГрафику</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическоеВремяПрибытия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОтбытияПоГрафику</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическоеВремяОтбытия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокГорючего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусНаселенногоПункта</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Автолавки/src/Documents/ПутевойЛист/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ГрафикПоездки") Тогда
		// Заполнение шапки
		НомерГрафика = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаТочкиМаршрута Из ДанныеЗаполнения.ТочкиМаршрута Цикл
			НоваяСтрока = СписокТочек.Добавить();
			НоваяСтрока.ВремяОтбытияПоГрафику = ТекСтрокаТочкиМаршрута.ВремяОтбытия;
			НоваяСтрока.ВремяПрибытияПоГрафику = ТекСтрокаТочкиМаршрута.ВремяПрибытия;
			НоваяСтрока.ТочкаМаршрута = ТекСтрокаТочкиМаршрута.ТочкаМаршрута;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
